In [1]:
list1 = [1,2,3,4,5]
list1

[1, 2, 3, 4, 5]

In [2]:
list1[2]

3

In [5]:
import pandas as pd

series1 = pd.Series(list1, index= ['a', 'b', 'c', 'd', 'e'])

In [7]:
series1['e']

5

In [10]:
rollnos =[10,20,30,40]

rollnos_series = pd.Series(rollnos, index =['rahul', 'arun', 'kumar', 'sagar'])

In [11]:
rollnos_series['sagar']

40

In [12]:
some_dict = {'a':1, 'b':2, 'c':3}

In [14]:
some_dict

{'a': 1, 'b': 2, 'c': 3}

In [15]:
pd.Series(some_dict)

a    1
b    2
c    3
dtype: int64

In [18]:
rollnos_series.max()

40

In [ ]:
def factorial(num1):

In [19]:
def print_welcome():
    print("i have been called, welcome to teh function definiition ")

In [20]:
print_welcome()

i have been called, welcome to teh function definiition

In [22]:
list_marks_updated =[]
for num in list_marks:
    num_updated = grace_marks(num)
    list_marks_updated.append(num_updated)

In [23]:
list_marks_updated

[60, 71, 60, 38, 27, 82, 93]

In [21]:
def grace_marks(marks):
    return marks+5


list_marks =[55,66,55,33,22,77,88]
series_marks = pd.Series(list_marks)
series_marks.apply(grace_marks)

0    60
1    71
2    60
3    38
4    27
5    82
6    93
dtype: int64

In [24]:
list_marks =[55,66,55,None,22,77,88]

series_marks = pd.Series(list_marks)

series_marks.isna()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [27]:
#series_marks.fillna(0, inplace=True)

series_marks = series_marks.fillna(0)

In [28]:
series_marks

0    55.0
1    66.0
2    55.0
3     0.0
4    22.0
5    77.0
6    88.0
dtype: float64

In [29]:
list_names= ['arun', 'kumar', 'rahul']
list_marks =[55,66,77]
combined_list = list(zip(list_names, list_marks))

In [30]:
combined_list

[('arun', 55), ('kumar', 66), ('rahul', 77)]

In [33]:
students_df = pd.DataFrame(combined_list, columns=['Name', 'Marks'] )

In [35]:
students_df.set_index('Name')

       Marks
Name
arun      55
kumar     66
rahul     77

In [36]:
dict_stds = {'taran':77,'arun':66, 'yasir':55}

In [43]:
dict_stds={'names':['taran', 'arun', 'yasir'], 'marks': [77,66,55]}

In [44]:
dict_stds

{'names': ['taran', 'arun', 'yasir'], 'marks': [77, 66, 55]}

In [46]:
stds_df = pd.DataFrame(dict_stds)

In [52]:
stds_df

   names  marks
0  taran     77
1   arun     66
2  yasir     55

In [48]:
std_list = [{'taran':77}, {'arun':66}, {'yasir':55}]

In [50]:
std_list =[{'names':'taran', 'marks':77},]

In [51]:
pd.DataFrame(std_list)

   names  marks
0  taran     77

In [53]:
stds_df

   names  marks
0  taran     77
1   arun     66
2  yasir     55

In [54]:
stds_df.set_index('names')

       marks
names
taran     77
arun      66
yasir     55

In [56]:
stds_df['marks']

0    77
1    66
2    55
Name: marks, dtype: int64

In [58]:
import numpy as np
arr_2d = np.random.randint(2,9,(4,2))

In [60]:
pd.DataFrame(arr_2d,  columns=['A', 'B'])

   A  B
0  8  3
1  3  8
2  8  2
3  6  7

In [64]:
stds_df[(stds_df['marks']>66) | (stds_df['names']=='taran')]

   names  marks
0  taran     77

In [71]:
stds_df = stds_df.rename(columns={'names':'Names', 'marks': 'Marks'})

In [74]:
stds_df

   Names  Marks
0  taran     77
1   arun     66
2  yasir     55

In [73]:
#stds_df.drop(columns ='Names')
stds_df.drop('Names', axis =1)

   Marks
0     77
1     66
2     55